Ret395/bulk/kOmegaSST-WF/mesh1/0.orig/T7
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T7;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

enforcedBC      uniform -9.140495867768595e+04;

boundaryField
{
    inlet
    {
        type             cyclic;
        value            $internalField;
    }
    bottom
    {
        type             fixedGradient;
        gradient         $enforcedBC;
    }
    outlet
    {
        type             cyclic;
        value            $internalField;
    }
    top
    {
        type             fixedGradient;
        gradient         $enforcedBC;
    }
    frontAndBack
    {
        type             empty;
    }
}

// ************************************************************************* //
